NextFOAM-2509/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOgrad
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

grad1
{
    // Mandatory entries
    type            grad;
    libs            (fieldFunctionObjects);
    field           U;

    // Optional (inherited) entries
    result          gradU;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.25;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 5;
    writeControl    timeStep;
    writeInterval   25;
}


grad2
{
    // Mandatory entries
    type            grad;
    libs            (fieldFunctionObjects);
    field           phi;

    // Optional (inherited) entries
    result          gradPhi;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.25;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 10;
    writeControl    timeStep;
    writeInterval   50;
}


// ************************************************************************* //
